#include <stdio.h>

int main(void) {
  printf("1024 : %5d, %5x, %o\n", 1024, 1024, 1024);
  printf("0x10 : %5d, %5x, %o\n", 0x10, 0x10, 0x10);
  printf(" 077 : %5d, %5x, %o\n", 077, 077, 077);

  printf("\n");
  
  printf("1024 : %5d,  %#x, %#o\n", 1024, 1024, 1024);
  printf("0x10 : %5d,  %#x,  %#o\n", 0x10, 0x10, 0x10);
  printf(" 077 : %5d, %#5x, %#4o\n", 077, 077, 077);
  
  return 0;
}

/*
실행 결과는 다음과 같다
1024 :  1024,   400, 2000
0x10 :    16,    10, 20
 077 :    63,    3f, 77

1024 :  1024,  0x400, 02000
0x10 :    16,  0x10,  020
 077 :    63,  0x3f,  077

만약 %#o와 %#x에서 특정 자릿수만큼 표현하고 싶다면
%#5x, %#5o와 같이 사용하면 된다.
*/

